app/controllers/api/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3)  [["id", 3], ["id", 2], ["id", 1]]
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT 25 OFFSET 0
---
  def index
    @posts = Post.includes(:user).order(created_at: :desc).page(params[:page])

INSERT INTO "posts" ("title", "content", "published", "published_at", "user_id", "created_at", "updated_at") VALUES ('test', 'test', FALSE, NULL, 1, '2025-10-25 11:44:31.100690', '2025-10-25 11:44:31.100690') RETURNING "id"
---
  def create
    @post = Post.new(post_params)

    if @post.save