app/views/api/posts/new.html.erb

SELECT "users".* FROM "users"
---
          <%= form.label :user_id, "Author", class: "form-label" %>
          <%= form.collection_select :user_id, User.all, :id, :email, { prompt: "Select author" }, class: "form-input" %>